In [50]:
import pandas as pd
import numpy as np

In [30]:
d = {"name":["sehan","amandi","Thessa","Savi"],"Age":[24,24,25,28]}
print(d)

{'name': ['sehan', 'amandi', 'Thessa', 'Savi'], 'Age': [24, 24, 25, 28]}

In [9]:
df = pd.DataFrame(d)
df

     name  Age
0   sehan   24
1  amandi   24
2  Thessa   25
3    Savi   28

In [17]:
df1=pd.read_csv("C:\\Users\\sdara\\Desktop\\Name.csv")
df1

      Name  Age      City
0    Alice   25  New York
1      Bob   30    London
2  Charlie   28     Paris

In [23]:
df.head()    # return the first 5 rows
df.tail()    # return the last 5 rows

     name  Age
0   sehan   24
1  amandi   24
2  Thessa   25
3    Savi   28

In [25]:
df.iloc[0,1]

24

In [39]:
df2 = pd.DataFrame( {"name":["sehan","amandi","Thessa","Savi"],"Age":[24,24,25,28]},index=["a","b","c","e"])
df2

     name  Age
a   sehan   24
b  amandi   24
c  Thessa   25
e    Savi   28

In [41]:
df2.drop("e")

     name  Age
a   sehan   24
b  amandi   24
c  Thessa   25

- some time we have to genearte some random  arrays in python when we are going to use python in ML
- now we can see how to concat the two data frames

In [54]:
dfA = pd.DataFrame(np.random.random((5,2)),columns = ["A","B"])
dfB = pd.DataFrame(np.random.random((5,2)),columns = ["A","B"])
dfC = pd.DataFrame(np.random.random((5,2)),columns = ["A","B"])

In [56]:
dfA

          A         B
0  0.397506  0.033014
1  0.237857  0.437066
2  0.731564  0.307015
3  0.069919  0.757533
4  0.739675  0.035873

In [58]:
dfB

          A         B
0  0.051378  0.903837
1  0.220956  0.592868
2  0.493963  0.843662
3  0.799180  0.596553
4  0.100641  0.364111

In [60]:
dfC

          A         B
0  0.368566  0.924487
1  0.129528  0.284046
2  0.571856  0.534912
3  0.183824  0.885749
4  0.734686  0.069964

In [62]:
pd.concat([dfA,dfB])

          A         B
0  0.397506  0.033014
1  0.237857  0.437066
2  0.731564  0.307015
3  0.069919  0.757533
4  0.739675  0.035873
0  0.051378  0.903837
1  0.220956  0.592868
2  0.493963  0.843662
3  0.799180  0.596553
4  0.100641  0.364111

In [70]:
pd.concat([dfA,dfB],axis=1)

          A         B         A         B
0  0.397506  0.033014  0.051378  0.903837
1  0.237857  0.437066  0.220956  0.592868
2  0.731564  0.307015  0.493963  0.843662
3  0.069919  0.757533  0.799180  0.596553
4  0.739675  0.035873  0.100641  0.364111